УправлениеИТФирмой_First/src/Catalogs/ВидыКонтактнойИнформации/ВидыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыКонтактнойИнформации</name>
  <predefined>
    <items>
      <name>EMailКонтрагента</name>
      <description>EMailКонтрагента</description>
    </items>
    <items>
      <name>ПочтовыйАдресКонтрагента</name>
      <description>ПочтовыйАдресКонтрагента</description>
    </items>
    <items>
      <name>ТелефонКонтрагента</name>
      <description>ТелефонКонтрагента</description>
    </items>
    <items>
      <name>ФактическийАдресКонтрагента</name>
      <description>ФактическийАдресКонтрагента</description>
    </items>
    <items>
      <name>ЮридическийАдресКонтрагента</name>
      <description>ЮридическийАдресКонтрагента</description>
    </items>
  </predefined>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыКонтактнойИнформации</types>
    </type>
  </attributes>
</mdclass:Catalog>

УправлениеИТФирмой_First/src/Enums/ТипыКонтактнойИнформации/ТипыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКонтактнойИнформации</name>
  <enumValues>
    <name>Адрес</name>
  </enumValues>
  <enumValues>
    <name>Телефон</name>
  </enumValues>
  <enumValues>
    <name>EMail</name>
  </enumValues>
</mdclass:Enum>

УправлениеИТФирмой_First/src/Catalogs/ВидыКонтактнойИнформации/ManagerModule.bsl
Процедура ЗаполнитьПредопределенныеЭлементы() Экспорт
	
	Выборка = Справочники.ВидыКонтактнойИнформации.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ТипОбъект = Выборка.ПолучитьОбъект();
		
		Если ТипОбъект.Тип = ТелефонКонтрагента.Тип Тогда
			Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
		ИначеЕсли ТипОбъект.Тип = EMailКонтрагента.Тип Тогда
			Тип = Перечисления.ТипыКонтактнойИнформации.EMail;
		Иначе 
			Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
		КонецЕсли;
		
		ТипОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры
